Revit 2027 API
BuiltInFailures.DimensionFailures.UnstableConstraintInFamily Property
 Constraints between geometry in the family can behave unpredictably on parameter modification. To make the family reliable, constrain geometry to levels, reference planes, or reference lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnstableConstraintInFamily { get; }
Public Shared ReadOnly Property UnstableConstraintInFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnstableConstraintInFamily {
	FailureDefinitionId^ get ();
}
static member UnstableConstraintInFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace